# Minimal Homebrew bundle for this public-safe macOS developer setup.
# Keep this file intentional: do not commit machine exports or transitive deps.

# Core command line tools
brew "git"
brew "gh"
brew "zsh"
brew "curl"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "tmux"
brew "git-delta"

# Runtime and project tooling
brew "node"
brew "pnpm"
brew "python"
brew "mise"
brew "uv"

# Desktop apps and fonts
cask "ghostty"
cask "iterm2"
cask "visual-studio-code"
cask "font-jetbrains-mono-nerd-font"

# Optional apps; install manually if wanted.
# cask "docker"
# cask "figma"
# cask "raycast"
# cask "orbstack"
